
#!usr/bin/perl

# while 循环 当给定条件为 true 时，重复执行语句或语句组。循环主体执行之前会先测试条件。

# until 循环  重复执行语句或语句组，直到给定的条件为 true。 循环主体执行之前会先测试条件。

# for 循环 多次执行一个语句序列，简化管理循环变量的代码。

# foreach 循环  foreach 循环用于迭代一个列表或集合变量的值。

# do...while 循环  除了它是在循环主体结尾测试条件外，其他与 while 语句类似。

# 嵌套循环



# next 停止执行从next语句的下一语句开始到循环体结束标识符之间的语句，转去执行continue语句块，然后再返回到循环体的起始处开始执行下一次循环。

# last  退出循环语句块，从而结束循环

# continue continue 语句块通常在条件语句再次判断前执行。

# redo 语句直接转到循环体的第一行开始重复执行本次循环，redo语句之后的语句不再执行，continue语句块也不再执行；

# goto 语句



#  无限循环
# for( ; ; )
# {
#    printf "循环会无限执行。\n";
# }